Tekla Open API Reference for Tekla Structures 2025
Solid.GetFaceEnumerator Method
 Returns a new face enumerator in the current plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FaceEnumerator GetFaceEnumerator()
Public Function GetFaceEnumerator As FaceEnumerator
Return Value
Type: FaceEnumerator
A face enumerator to enumerate through solid faces.
Implements
ISolid.GetFaceEnumerator()
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace